In [164]:
import numpy as np
import pandas as pd
arrays=[["bar","bar","baz","baz","foo","foo","qux","qux"],["one","two","one","two","one","two","one","two"]]
tuples=list(zip(*arrays))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [165]:
index=pd.MultiIndex.from_tuples(tuples,names=["first","second"])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [166]:
s=pd.Series(np.random.randn(8),index=index)
s

first  second
bar    one      -0.015596
       two       0.522200
baz    one      -0.757236
       two      -1.072490
foo    one       2.211611
       two      -1.941436
qux    one       0.906448
       two       1.905867
dtype: float64

In [167]:
df=pd.DataFrame(np.random.randn(8,4),index=index)
df

                     0         1         2         3
first second
bar   one     0.257639 -0.666255 -0.741498  0.465070
      two    -1.444812 -0.551912  0.654068  0.980252
baz   one    -0.086630 -0.140690 -0.670582 -1.086896
      two     0.415207  0.013267  0.674847  0.305802
foo   one     0.875872 -0.106275 -0.134687 -2.129574
      two    -0.828445  0.402367  0.317368  0.798013
qux   one     0.350709  0.957971  1.065574  0.065143
      two     0.529266  1.564630  1.042732 -0.851012

In [168]:
df.index.names

FrozenList(['first', 'second'])

In [169]:
df = pd.DataFrame(np.random.randn(3, 8), index=["A", "B", "C"], columns=index)
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A       0.386037 -0.253939  0.458455 -1.354362 -0.845291 -1.617284 -1.223787
B       0.515023  1.845892  0.155721  0.496315 -0.161996 -0.597849  0.919092
C      -1.055858  0.581008 -1.458054  0.617548 -0.655351 -1.407565  0.538651

first
second       two
A       0.848313
B       1.314411
C       0.973719

In [170]:
df2=pd.DataFrame(np.random.randn(6, 6), index=index[:6], columns=index[:6])
df2

first              bar                 baz                 foo
second             one       two       one       two       one       two
first second
bar   one     0.240023  0.487053  1.430756  1.749145  0.064823 -1.129669
      two     0.300172 -0.480722  0.383321  2.780844  0.298680 -0.012882
baz   one    -0.313063  2.140798 -0.314297 -0.433566 -0.720226 -1.830923
      two     0.497527  0.496321  0.476155  1.251049  0.460910 -1.265641
foo   one     1.016008 -0.992495 -0.459634  0.503867  0.776639  0.268123
      two     0.043749 -0.223163 -1.430408  0.134989 -0.263923 -1.076844

In [171]:
with pd.option_context("display.multi_sparse", False):
    df

In [172]:
pd.Series(np.random.randn(8), index=tuples)

(bar, one)    0.732553
(bar, two)   -0.378108
(baz, one)    2.763749
(baz, two)    0.544517
(foo, one)   -0.708622
(foo, two)    0.242053
(qux, one)   -1.156195
(qux, two)   -0.597793
dtype: float64

In [173]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [174]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [175]:
index.get_level_values("second")

Index(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'], dtype='object', name='second')

In [176]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A       0.386037 -0.253939  0.458455 -1.354362 -0.845291 -1.617284 -1.223787
B       0.515023  1.845892  0.155721  0.496315 -0.161996 -0.597849  0.919092
C      -1.055858  0.581008 -1.458054  0.617548 -0.655351 -1.407565  0.538651

first
second       two
A       0.848313
B       1.314411
C       0.973719

In [177]:
df["bar"]

second       one       two
A       0.386037 -0.253939
B       0.515023  1.845892
C      -1.055858  0.581008

In [178]:
df["bar", "one"]

A    0.386037
B    0.515023
C   -1.055858
Name: (bar, one), dtype: float64

In [179]:
df["bar"]["one"]

A    0.386037
B    0.515023
C   -1.055858
Name: one, dtype: float64

In [180]:
s

first  second
bar    one      -0.015596
       two       0.522200
baz    one      -0.757236
       two      -1.072490
foo    one       2.211611
       two      -1.941436
qux    one       0.906448
       two       1.905867
dtype: float64

In [181]:
s["qux"]

second
one    0.906448
two    1.905867
dtype: float64

In [182]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A       0.386037 -0.253939  0.458455 -1.354362 -0.845291 -1.617284 -1.223787
B       0.515023  1.845892  0.155721  0.496315 -0.161996 -0.597849  0.919092
C      -1.055858  0.581008 -1.458054  0.617548 -0.655351 -1.407565  0.538651

first
second       two
A       0.848313
B       1.314411
C       0.973719

In [183]:
df.columns.levels

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

In [184]:
df[["foo","qux"]]

first        foo                 qux
second       one       two       one       two
A      -0.845291 -1.617284 -1.223787  0.848313
B      -0.161996 -0.597849  0.919092  1.314411
C      -0.655351 -1.407565  0.538651  0.973719

In [185]:
df[["foo","qux"]].columns.levels

FrozenList([['bar', 'baz', 'foo', 'qux'], ['one', 'two']])

In [186]:
df[["foo", "qux"]].columns.to_numpy()

array([('foo', 'one'), ('foo', 'two'), ('qux', 'one'), ('qux', 'two')],
      dtype=object)

In [187]:
df[["foo", "qux"]].columns.get_level_values(0)

Index(['foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [188]:
df[["foo", "qux"]].columns.remove_unused_levels().levels

FrozenList([['foo', 'qux'], ['one', 'two']])

In [189]:
s

first  second
bar    one      -0.015596
       two       0.522200
baz    one      -0.757236
       two      -1.072490
foo    one       2.211611
       two      -1.941436
qux    one       0.906448
       two       1.905867
dtype: float64

In [190]:
s[:-2]

first  second
bar    one      -0.015596
       two       0.522200
baz    one      -0.757236
       two      -1.072490
foo    one       2.211611
       two      -1.941436
dtype: float64

In [196]:
#do not understant 
s.index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [206]:
#still not understant, can replace by other method
#-----------------------need ignose----------------
s[::1]

first  second
bar    one      -0.015596
       two       0.522200
baz    one      -0.757236
       two      -1.072490
foo    one       2.211611
       two      -1.941436
qux    one       0.906448
       two       1.905867
dtype: float64

In [207]:
s + s[:-2]

first  second
bar    one      -0.031192
       two       1.044399
baz    one      -1.514473
       two      -2.144981
foo    one       4.423221
       two      -3.882873
qux    one            NaN
       two            NaN
dtype: float64

In [208]:
s + s[::2]

first  second
bar    one      -0.031192
       two            NaN
baz    one      -1.514473
       two            NaN
foo    one       4.423221
       two            NaN
qux    one       1.812895
       two            NaN
dtype: float64

In [209]:
s.reindex(index[:3])

first  second
bar    one      -0.015596
       two       0.522200
baz    one      -0.757236
dtype: float64

In [210]:
s.reindex([("foo", "two"), ("bar", "one"), ("qux", "one"), ("baz", "one")])

first  second
foo    two      -1.941436
bar    one      -0.015596
qux    one       0.906448
baz    one      -0.757236
dtype: float64

In [211]:
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A       0.386037 -0.253939  0.458455 -1.354362 -0.845291 -1.617284 -1.223787
B       0.515023  1.845892  0.155721  0.496315 -0.161996 -0.597849  0.919092
C      -1.055858  0.581008 -1.458054  0.617548 -0.655351 -1.407565  0.538651

first
second       two
A       0.848313
B       1.314411
C       0.973719

In [212]:
df=df.T
df

                     A         B         C
first second
bar   one     0.386037  0.515023 -1.055858
      two    -0.253939  1.845892  0.581008
baz   one     0.458455  0.155721 -1.458054
      two    -1.354362  0.496315  0.617548
foo   one    -0.845291 -0.161996 -0.655351
      two    -1.617284 -0.597849 -1.407565
qux   one    -1.223787  0.919092  0.538651
      two     0.848313  1.314411  0.973719

In [213]:
df.loc[("bar", "two")]

A   -0.253939
B    1.845892
C    0.581008
Name: (bar, two), dtype: float64

In [214]:
df.loc[("bar", "two"), "A"]

-0.25393872672014645

In [215]:
df.loc["bar"]

               A         B         C
second
one     0.386037  0.515023 -1.055858
two    -0.253939  1.845892  0.581008

In [216]:
df.loc["baz":"foo"]

                     A         B         C
first second
baz   one     0.458455  0.155721 -1.458054
      two    -1.354362  0.496315  0.617548
foo   one    -0.845291 -0.161996 -0.655351
      two    -1.617284 -0.597849 -1.407565

In [217]:
df.loc[("baz", "two"):("qux", "one")]

                     A         B         C
first second
baz   two    -1.354362  0.496315  0.617548
foo   one    -0.845291 -0.161996 -0.655351
      two    -1.617284 -0.597849 -1.407565
qux   one    -1.223787  0.919092  0.538651

In [218]:
df.loc[("baz", "two"):"foo"]

                     A         B         C
first second
baz   two    -1.354362  0.496315  0.617548
foo   one    -0.845291 -0.161996 -0.655351
      two    -1.617284 -0.597849 -1.407565

In [219]:
df.loc[[("bar", "two"), ("qux", "one")]]

                     A         B         C
first second
bar   two    -0.253939  1.845892  0.581008
qux   one    -1.223787  0.919092  0.538651

In [220]:
s = pd.Series(
    [1, 2, 3, 4, 5, 6],
    index=pd.MultiIndex.from_product([["A", "B"], ["c", "d", "e"]]),)
s

A  c    1
   d    2
   e    3
B  c    4
   d    5
   e    6
dtype: int64

In [221]:
s.loc[[("A", "c"), ("B", "d")]]

A  c    1
B  d    5
dtype: int64

In [222]:
s.loc[(["A", "B"], ["c", "d"])]

A  c    1
   d    2
B  c    4
   d    5
dtype: int64

In [223]:
df

                     A         B         C
first second
bar   one     0.386037  0.515023 -1.055858
      two    -0.253939  1.845892  0.581008
baz   one     0.458455  0.155721 -1.458054
      two    -1.354362  0.496315  0.617548
foo   one    -0.845291 -0.161996 -0.655351
      two    -1.617284 -0.597849 -1.407565
qux   one    -1.223787  0.919092  0.538651
      two     0.848313  1.314411  0.973719

In [224]:
def mklbl(prefix, n):
    return ["%s%s" % (prefix, i) for i in range(n)]

In [225]:
#producet index
miindex = pd.MultiIndex.from_product(
    [mklbl("A", 4), mklbl("B", 2), mklbl("C", 4), mklbl("D", 2)]
)
miindex

MultiIndex([('A0', 'B0', 'C0', 'D0'),
            ('A0', 'B0', 'C0', 'D1'),
            ('A0', 'B0', 'C1', 'D0'),
            ('A0', 'B0', 'C1', 'D1'),
            ('A0', 'B0', 'C2', 'D0'),
            ('A0', 'B0', 'C2', 'D1'),
            ('A0', 'B0', 'C3', 'D0'),
            ('A0', 'B0', 'C3', 'D1'),
            ('A0', 'B1', 'C0', 'D0'),
            ('A0', 'B1', 'C0', 'D1'),
            ('A0', 'B1', 'C1', 'D0'),
            ('A0', 'B1', 'C1', 'D1'),
            ('A0', 'B1', 'C2', 'D0'),
            ('A0', 'B1', 'C2', 'D1'),
            ('A0', 'B1', 'C3', 'D0'),
            ('A0', 'B1', 'C3', 'D1'),
            ('A1', 'B0', 'C0', 'D0'),
            ('A1', 'B0', 'C0', 'D1'),
            ('A1', 'B0', 'C1', 'D0'),
            ('A1', 'B0', 'C1', 'D1'),
            ('A1', 'B0', 'C2', 'D0'),
            ('A1', 'B0', 'C2', 'D1'),
            ('A1', 'B0', 'C3', 'D0'),
            ('A1', 'B0', 'C3', 'D1'),
            ('A1', 'B1', 'C0', 'D0'),
            ('A1', 'B1', 'C0', 'D1'),
            ('A1', 'B1', 'C1', 'D0'),
            ('A1', 'B1', 'C1', 'D1'),
            ('A1', 'B1', 'C2', 'D0'),
            ('A1', 'B1', 'C2', 'D1'),
            ('A1', 'B1', 'C3', 'D0'),
            ('A1', 'B1', 'C3', 'D1'),
            ('A2', 'B0', 'C0', 'D0'),
            ('A2', 'B0', 'C0', 'D1'),
            ('A2', 'B0', 'C1', 'D0'),
            ('A2', 'B0', 'C1', 'D1'),
            ('A2', 'B0', 'C2', 'D0'),
            ('A2', 'B0', 'C2', 'D1'),
            ('A2', 'B0', 'C3', 'D0'),
            ('A2', 'B0', 'C3', 'D1'),
            ('A2', 'B1', 'C0', 'D0'),
            ('A2', 'B1', 'C0', 'D1'),
            ('A2', 'B1', 'C1', 'D0'),
            ('A2', 'B1', 'C1', 'D1'),
            ('A2', 'B1', 'C2', 'D0'),
            ('A2', 'B1', 'C2', 'D1'),
            ('A2', 'B1', 'C3', 'D0'),
            ('A2', 'B1', 'C3', 'D1'),
            ('A3', 'B0', 'C0', 'D0'),
            ('A3', 'B0', 'C0', 'D1'),
            ('A3', 'B0', 'C1', 'D0'),
            ('A3', 'B0', 'C1', 'D1'),
            ('A3', 'B0', 'C2', 'D0'),
            ('A3', 'B0', 'C2', 'D1'),
            ('A3', 'B0', 'C3', 'D0'),
            ('A3', 'B0', 'C3', 'D1'),
            ('A3', 'B1', 'C0', 'D0'),
            ('A3', 'B1', 'C0', 'D1'),
            ('A3', 'B1', 'C1', 'D0'),
            ('A3', 'B1', 'C1', 'D1'),
            ('A3', 'B1', 'C2', 'D0'),
            ('A3', 'B1', 'C2', 'D1'),
            ('A3', 'B1', 'C3', 'D0'),
            ('A3', 'B1', 'C3', 'D1')],
           )

In [226]:
micolumns = pd.MultiIndex.from_tuples(
     [("a", "foo"), ("a", "bar"), ("b", "foo"), ("b", "bah")], names=["lvl0","lvl1"]
)
micolumns

MultiIndex([('a', 'foo'),
            ('a', 'bar'),
            ('b', 'foo'),
            ('b', 'bah')],
           names=['lvl0', 'lvl1'])

In [227]:
dfmi = (
    pd.DataFrame(
        np.arange(len(miindex) * len(micolumns)).reshape(
            (len(miindex), len(micolumns))
        ),
        index=miindex,
        columns=micolumns,
    )
    .sort_index()
    .sort_index(axis=1)
)
dfmi

lvl0           a         b
lvl1         bar  foo  bah  foo
A0 B0 C0 D0    1    0    3    2
         D1    5    4    7    6
      C1 D0    9    8   11   10
         D1   13   12   15   14
      C2 D0   17   16   19   18
...          ...  ...  ...  ...
A3 B1 C1 D1  237  236  239  238
      C2 D0  241  240  243  242
         D1  245  244  247  246
      C3 D0  249  248  251  250
         D1  253  252  255  254

[64 rows x 4 columns]

In [228]:
slice("A1", "A3"), slice(None), ["C1", "C3"]

(slice('A1', 'A3', None), slice(None, None, None), ['C1', 'C3'])

In [229]:
dfmi.loc[(slice("A1", "A3"), slice(None), ["C1", "C3"]), :]

lvl0           a         b
lvl1         bar  foo  bah  foo
A1 B0 C1 D0   73   72   75   74
         D1   77   76   79   78
      C3 D0   89   88   91   90
         D1   93   92   95   94
   B1 C1 D0  105  104  107  106
         D1  109  108  111  110
      C3 D0  121  120  123  122
         D1  125  124  127  126
A2 B0 C1 D0  137  136  139  138
         D1  141  140  143  142
      C3 D0  153  152  155  154
         D1  157  156  159  158
   B1 C1 D0  169  168  171  170
         D1  173  172  175  174
      C3 D0  185  184  187  186
         D1  189  188  191  190
A3 B0 C1 D0  201  200  203  202
         D1  205  204  207  206
      C3 D0  217  216  219  218
         D1  221  220  223  222
   B1 C1 D0  233  232  235  234
         D1  237  236  239  238
      C3 D0  249  248  251  250
         D1  253  252  255  254

In [230]:
idx = pd.IndexSlice
idx

In [231]:
dfmi.loc[idx[:, :, ["C1", "C3"]], idx[:, "foo"]]

lvl0           a    b
lvl1         foo  foo
A0 B0 C1 D0    8   10
         D1   12   14
      C3 D0   24   26
         D1   28   30
   B1 C1 D0   40   42
         D1   44   46
      C3 D0   56   58
         D1   60   62
A1 B0 C1 D0   72   74
         D1   76   78
      C3 D0   88   90
         D1   92   94
   B1 C1 D0  104  106
         D1  108  110
      C3 D0  120  122
         D1  124  126
A2 B0 C1 D0  136  138
         D1  140  142
      C3 D0  152  154
         D1  156  158
   B1 C1 D0  168  170
         D1  172  174
      C3 D0  184  186
         D1  188  190
A3 B0 C1 D0  200  202
         D1  204  206
      C3 D0  216  218
         D1  220  222
   B1 C1 D0  232  234
         D1  236  238
      C3 D0  248  250
         D1  252  254

In [232]:
#why the 'foo' can not replace by 'a'
#this method can replace by idx
#when use 'dfmi.loc["A1", (slice(None),"a","foo")]'
#It will report err
dfmi.loc["A1", (slice(None),"foo")]

lvl0        a    b
lvl1      foo  foo
B0 C0 D0   64   66
      D1   68   70
   C1 D0   72   74
      D1   76   78
   C2 D0   80   82
      D1   84   86
   C3 D0   88   90
      D1   92   94
B1 C0 D0   96   98
      D1  100  102
   C1 D0  104  106
      D1  108  110
   C2 D0  112  114
      D1  116  118
   C3 D0  120  122
      D1  124  126

In [233]:
dfmi.loc[idx[:, :, ["C1", "C3"]], idx[:, "foo"]]

lvl0           a    b
lvl1         foo  foo
A0 B0 C1 D0    8   10
         D1   12   14
      C3 D0   24   26
         D1   28   30
   B1 C1 D0   40   42
         D1   44   46
      C3 D0   56   58
         D1   60   62
A1 B0 C1 D0   72   74
         D1   76   78
      C3 D0   88   90
         D1   92   94
   B1 C1 D0  104  106
         D1  108  110
      C3 D0  120  122
         D1  124  126
A2 B0 C1 D0  136  138
         D1  140  142
      C3 D0  152  154
         D1  156  158
   B1 C1 D0  168  170
         D1  172  174
      C3 D0  184  186
         D1  188  190
A3 B0 C1 D0  200  202
         D1  204  206
      C3 D0  216  218
         D1  220  222
   B1 C1 D0  232  234
         D1  236  238
      C3 D0  248  250
         D1  252  254

In [234]:
mask = dfmi[("a", "foo")] > 200
mask

A0  B0  C0  D0    False
            D1    False
        C1  D0    False
            D1    False
        C2  D0    False
                  ...
A3  B1  C1  D1     True
        C2  D0     True
            D1     True
        C3  D0     True
            D1     True
Name: (a, foo), Length: 64, dtype: bool

In [235]:
dfmi.loc[idx[mask, :, ["C1", "C3"]], idx[:, "foo"]]

lvl0           a    b
lvl1         foo  foo
A3 B0 C1 D1  204  206
      C3 D0  216  218
         D1  220  222
   B1 C1 D0  232  234
         D1  236  238
      C3 D0  248  250
         D1  252  254

In [236]:
dfmi.loc(axis=0)[:, :, ["C1", "C3"]]

lvl0           a         b
lvl1         bar  foo  bah  foo
A0 B0 C1 D0    9    8   11   10
         D1   13   12   15   14
      C3 D0   25   24   27   26
         D1   29   28   31   30
   B1 C1 D0   41   40   43   42
         D1   45   44   47   46
      C3 D0   57   56   59   58
         D1   61   60   63   62
A1 B0 C1 D0   73   72   75   74
         D1   77   76   79   78
      C3 D0   89   88   91   90
         D1   93   92   95   94
   B1 C1 D0  105  104  107  106
         D1  109  108  111  110
      C3 D0  121  120  123  122
         D1  125  124  127  126
A2 B0 C1 D0  137  136  139  138
         D1  141  140  143  142
      C3 D0  153  152  155  154
         D1  157  156  159  158
   B1 C1 D0  169  168  171  170
         D1  173  172  175  174
      C3 D0  185  184  187  186
         D1  189  188  191  190
A3 B0 C1 D0  201  200  203  202
         D1  205  204  207  206
      C3 D0  217  216  219  218
         D1  221  220  223  222
   B1 C1 D0  233  232  235  234
         D1  237  236  239  238
      C3 D0  249  248  251  250
         D1  253  252  255  254

In [237]:
df2 = dfmi.copy()
df2.loc(axis=0)[:, :, ["C1", "C3"]] = -10
df2

lvl0           a         b
lvl1         bar  foo  bah  foo
A0 B0 C0 D0    1    0    3    2
         D1    5    4    7    6
      C1 D0  -10  -10  -10  -10
         D1  -10  -10  -10  -10
      C2 D0   17   16   19   18
...          ...  ...  ...  ...
A3 B1 C1 D1  -10  -10  -10  -10
      C2 D0  241  240  243  242
         D1  245  244  247  246
      C3 D0  -10  -10  -10  -10
         D1  -10  -10  -10  -10

[64 rows x 4 columns]

In [238]:
df

                     A         B         C
first second
bar   one     0.386037  0.515023 -1.055858
      two    -0.253939  1.845892  0.581008
baz   one     0.458455  0.155721 -1.458054
      two    -1.354362  0.496315  0.617548
foo   one    -0.845291 -0.161996 -0.655351
      two    -1.617284 -0.597849 -1.407565
qux   one    -1.223787  0.919092  0.538651
      two     0.848313  1.314411  0.973719

In [239]:
df.xs("one", level="second")

              A         B         C
first
bar    0.386037  0.515023 -1.055858
baz    0.458455  0.155721 -1.458054
foo   -0.845291 -0.161996 -0.655351
qux   -1.223787  0.919092  0.538651

In [240]:
df = df.T
df

first        bar                 baz                 foo                 qux  \
second       one       two       one       two       one       two       one
A       0.386037 -0.253939  0.458455 -1.354362 -0.845291 -1.617284 -1.223787
B       0.515023  1.845892  0.155721  0.496315 -0.161996 -0.597849  0.919092
C      -1.055858  0.581008 -1.458054  0.617548 -0.655351 -1.407565  0.538651

first
second       two
A       0.848313
B       1.314411
C       0.973719

In [241]:
df.xs("one", level="second", axis=1)

first       bar       baz       foo       qux
A      0.386037  0.458455 -0.845291 -1.223787
B      0.515023  0.155721 -0.161996  0.919092
C     -1.055858 -1.458054 -0.655351  0.538651

In [242]:
df.xs(("one", "bar"), level=("second", "first"), axis=1)

first        bar
second       one
A       0.386037
B       0.515023
C      -1.055858

In [243]:
midx = pd.MultiIndex(
    levels=[["zero", "one"], ["x", "y"]], codes=[[1, 1, 0, 0], [1, 0, 1, 0]]
)
midx

MultiIndex([( 'one', 'y'),
            ( 'one', 'x'),
            ('zero', 'y'),
            ('zero', 'x')],
           )

In [245]:
df = pd.DataFrame(np.random.randn(4, 2), index=midx)
df

               0         1
one  y -0.946007 -0.688435
     x  0.833657 -1.436615
zero y  0.497529  0.099169
     x  1.230726  0.443430

In [246]:
df2 = df.groupby(level=0).mean()
df2

             0         1
one  -0.056175 -1.062525
zero  0.864127  0.271300

In [247]:
df2 = df.groupby(level=1).mean()
df2

          0         1
x  1.032192 -0.496593
y -0.224239 -0.294633

In [248]:
df

               0         1
one  y -0.946007 -0.688435
     x  0.833657 -1.436615
zero y  0.497529  0.099169
     x  1.230726  0.443430

In [249]:
df[:5]

               0         1
one  y -0.946007 -0.688435
     x  0.833657 -1.436615
zero y  0.497529  0.099169
     x  1.230726  0.443430

In [250]:
# switch the order of two levels
df.swaplevel(0, 1, axis=0)

               0         1
y one  -0.946007 -0.688435
x one   0.833657 -1.436615
y zero  0.497529  0.099169
x zero  1.230726  0.443430

In [251]:
#generalizes the swaplevel method, allowing you to permute the hierarchical index
#levels in one step
df[:5].reorder_levels([1, 0], axis=0)

               0         1
y one  -0.946007 -0.688435
x one   0.833657 -1.436615
y zero  0.497529  0.099169
x zero  1.230726  0.443430

In [252]:
df.rename(columns={0: "col0", 1: "col1"})

            col0      col1
one  y -0.946007 -0.688435
     x  0.833657 -1.436615
zero y  0.497529  0.099169
     x  1.230726  0.443430

In [253]:
df.rename(index={"one": "two", "y": "z"})

               0         1
two  z -0.946007 -0.688435
     x  0.833657 -1.436615
zero z  0.497529  0.099169
     x  1.230726  0.443430

In [254]:
df.rename_axis(index=["abc", "def"])

                 0         1
abc  def
one  y   -0.946007 -0.688435
     x    0.833657 -1.436615
zero y    0.497529  0.099169
     x    1.230726  0.443430

In [255]:
s = pd.Series(np.random.randn(8), index=pd.MultiIndex.from_tuples(tuples))
s

bar  one   -1.561687
     two   -1.898704
baz  one    0.633918
     two    0.430696
foo  one    0.955733
     two   -1.082849
qux  one   -0.252151
     two    0.274501
dtype: float64

In [256]:
s.sort_index()

bar  one   -1.561687
     two   -1.898704
baz  one    0.633918
     two    0.430696
foo  one    0.955733
     two   -1.082849
qux  one   -0.252151
     two    0.274501
dtype: float64

In [257]:
s.sort_index(level=1)

bar  one   -1.561687
baz  one    0.633918
foo  one    0.955733
qux  one   -0.252151
bar  two   -1.898704
baz  two    0.430696
foo  two   -1.082849
qux  two    0.274501
dtype: float64

In [258]:
s.index.set_names(["L1", "L2"], inplace=True)
s

L1   L2
bar  one   -1.561687
     two   -1.898704
baz  one    0.633918
     two    0.430696
foo  one    0.955733
     two   -1.082849
qux  one   -0.252151
     two    0.274501
dtype: float64

In [259]:
s.sort_index(level="L2")

L1   L2
bar  one   -1.561687
baz  one    0.633918
foo  one    0.955733
qux  one   -0.252151
bar  two   -1.898704
baz  two    0.430696
foo  two   -1.082849
qux  two    0.274501
dtype: float64

In [260]:
df.T

        one                zero
          y         x         y         x
0 -0.946007  0.833657  0.497529  1.230726
1 -0.688435 -1.436615  0.099169  0.443430

In [261]:
df.T.sort_index(level=1, axis=1)

        one      zero       one      zero
          x         x         y         y
0  0.833657  1.230726 -0.946007  0.497529
1 -1.436615  0.443430 -0.688435  0.099169

In [262]:
dfm = pd.DataFrame(
    {"jim": [0, 0, 1, 1], "joe": ["x", "x", "z", "y"], "jolie": np.random.rand(4)}
)
dfm
#the next step must before print dfm ??
dfm = dfm.set_index(["jim", "joe"])
dfm

            jolie
jim joe
0   x    0.474438
    x    0.498103
1   z    0.612064
    y    0.950054

In [263]:
#It will show PerformanceWarning: indexing past lexsort depth may impact performance
#dfm.loc[(1,'z')]

In [264]:
#report err, the reason is you try to index something that is not fully lexsorted
#dfm.loc[(0, 'y'):(1, 'z')]

In [265]:
index = pd.Index(np.random.randint(0, 1000, 10))
index

Int64Index([462, 578, 339, 151, 197, 836, 643, 114, 610, 727], dtype='int64')

In [266]:
positions = [0, 9, 3]
index[positions]

Int64Index([462, 727, 151], dtype='int64')

In [267]:
index.take(positions)

Int64Index([462, 727, 151], dtype='int64')

In [268]:
frm = pd.DataFrame(np.random.randn(5, 3))
frm

          0         1         2
0 -1.135813  0.075331 -1.973374
1  0.079793  0.822339 -1.952284
2  0.258156 -1.505922 -0.088135
3  0.392721 -0.224046 -0.027476
4 -1.081732 -0.361483 -1.366850

In [269]:
frm.take([1, 4, 3])

          0         1         2
1  0.079793  0.822339 -1.952284
4 -1.081732 -0.361483 -1.366850
3  0.392721 -0.224046 -0.027476

In [270]:
frm.take([0, 2], axis=1)

          0         2
0 -1.135813 -1.973374
1  0.079793 -1.952284
2  0.258156 -0.088135
3  0.392721 -0.027476
4 -1.081732 -1.366850

In [271]:
arr = np.random.randn(10)
arr

array([-0.02286748,  0.25788241,  0.18725787, -0.23200964,  0.47376546,
       -0.03708955,  3.21769051, -0.71557463,  0.6140427 , -0.52363773])

In [272]:
arr.take([False, False, True, True])

array([-0.02286748, -0.02286748,  0.25788241,  0.25788241])

In [273]:
from pandas.api.types import CategoricalDtype
df = pd.DataFrame({"A": np.arange(6), "B": list("aabbca")})
df

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  c
5  5  a

In [274]:
df["B"] = df["B"].astype(CategoricalDtype(list("cab")))
df

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  c
5  5  a

In [275]:
df.dtypes

A       int32
B    category
dtype: object

In [276]:
df["B"].cat.categories

Index(['c', 'a', 'b'], dtype='object')

In [277]:
df2 = df.set_index("B")
df2

   A
B
a  0
a  1
b  2
b  3
c  4
a  5

In [278]:
df2.index

CategoricalIndex(['a', 'a', 'b', 'b', 'c', 'a'], categories=['c', 'a', 'b'], ordered=False, name='B', dtype='category')

In [279]:
df2.groupby(level=0).sum()

   A
B
c  4
a  6
b  5

In [280]:
indexf = pd.Index([1.5, 2, 3, 4.5, 5])
indexf

Float64Index([1.5, 2.0, 3.0, 4.5, 5.0], dtype='float64')

In [281]:
sf = pd.Series(range(5), index=indexf)
sf

1.5    0
2.0    1
3.0    2
4.5    3
5.0    4
dtype: int64

In [282]:
sf.loc[4.5]

3

In [283]:
sf.iloc[3]

3

In [284]:
sf[2.1:4.6]

3.0    2
4.5    3
dtype: int64

In [285]:
df = pd.DataFrame(
    {"A": [1, 2, 3, 4]}, index=pd.IntervalIndex.from_breaks([0, 1, 2, 3, 4])
)
df

        A
(0, 1]  1
(1, 2]  2
(2, 3]  3
(3, 4]  4

In [286]:
df.loc[2]

A    2
Name: (1, 2], dtype: int64

In [287]:
df.loc[[2.5, 3.5]]

        A
(2, 3]  3
(3, 4]  4

In [288]:
df.loc[pd.Interval(1, 2)]

A    2
Name: (1, 2], dtype: int64